src/spring2020.org
#+TITLE:     Assignments | CISC 3130 Data Structures
#+SUBTITLE:  Department of Computer & Information Science, Brooklyn College
#+AUTHOR:    Katherine Chuang
#+EMAIL:     chuang@sci.brooklyn.cuny.edu
#+UNIVERSITY: Brooklyn College
#+DEPARTMENT: Department of CIS
#+DATE:      2020-01-27
#+DESCRIPTION: Describe assignments for the class. Course notes at http://libguides.brooklyn.cuny.edu/cisc3130
#+KEYWORDS:
#+LANGUAGE:  en
#+TODO: TODO(t) | DONE(d)
#+TODO: MISSING(nil) OPTIONAL(o) | UPDATED(u)
#+OPTIONS:   H:3 num:n toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+TOC: listings
#+TOC: tables
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: ../assignments/index.html
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Quicksand:400,700|Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="spec-style.css" rel="stylesheet" type="text/css" />

#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+HTML_MATHJAX: cancel.js noErrors.js

#+HTML:
#+HTML: <div class="outline-2" id="meta" style="font-size:12px">
*Course Page:* [[https://libguides.brooklyn.cuny.edum/cisc3130]]\\
*Semester*: Spring 2020\\
*Professor:* {{{author}}} ({{{email}}})\\
/This is part of the OER resource released under Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License./
#+HTML: </div>


* Assignment Due Dates
:PROPERTIES:
:UNNUMBERED: notoc
:END:
This section to summarize the links for submitting assignments.

#+HTML: <div style="width:550px;text-align:left;">
| *Assignment*                       | Due Date  | Link |
|------------------------------------+-----------+------|
| =[A1]= [[#a1][Top Streaming Music Artists]] | 2/20/2020 | Form |
| =[A2]= [[#a2][Music Playlist]]              | 3/5/2020  | Form |
| =[A3]= [[#a3][Assignment 3]]                | 3/19/2020 | Form |
| =[A4]= [[#a4][Assignment 4]]                | 4/2/2020  | Form |
| =[A5]= [[#a5][Assignment 5]]                | 4/30/2020 | Form |

#+HTML: </div>

\\
Each of the google forms linked above creates a spreadsheet, which I use as my checklist to review the work submitted. I will not be checking my email for assignment submissions and due to technical difficulties with my browser, will not be downloading attachments for submissions.

Please avoid submitting the following types of files: ~.class~, ~.jar~, ~.zip~

* Objective

Take home assignments are opportunities to enhance the concepts and theories we cover in class in a more tangible way. You would find the most value of these assignments if you treat them with the seriousness as if you were employed but a VIP client, albeit with obscure and outdated data processing needs.

Assignments are structured as if you were hired on as a developer in training.

** Your Role

Imagine you are the developer and manager hh
on a team of one. This means that you are solely responsible for delivering your code on time, and. That the code you produce you are
 proud of owning. All the tasks are specified in advance so that you can schedule time to complete them in your own time.

All the assignments boil down to an essence with very similar work flow:

- Read in a text file provided
- Process text file as needed by the task requirements
- Output as specified by the assignment requirements
- Submit the code to the form by the due date

The project tasks are scoped to be bite sized pieces of much more full-fledged programming projects for large companies, which go through the steps to extract, transform, and load (ETL) data into databases.

While full time professions might work with gigabytes or terabytes of data at a time, in this class we will limit data sizes of 1MB or smaller text files per assignment. That being said, we will not be concerned with transforming data from one product to another. We will just be using Java programs to convert data from unstructured to structured data.

Each of the assignments can be completed within an afternoon by an experienced programmer who has grasped the fundamentals of data structure concepts. Since you are learning the data structures this semester, you will likely need more than a couple of hours so the assignments are scheduled such that you have approximately two weeks of time to focus on each.

** Technology requirements

 - Your text editor/IDE of choice. I mainly use vim or emacs text editor [fn:1]
 - Your version control system (VCS) of choice. I mainly use git and github [fn:2]
 - Internet connection to submit the assignment by the due date
 - Might add more later

** Grading Rubric

The assignments will be graded on a scale of /strong effort/ and /weak effort/. Late assignments means submitting any time after the specified due date, and will limited to score of one regardless of the level of effort. Not turning in on time will be given a score of zero. Late assignments will be accepted until the close of business on 4/30/2020 All assignments combined are 20% of your final grade.

Weak effort looks like someone who rushed to get the work done. For example,

- Met most of specs but didn't check carefully over their work.
- Noticeable amount of typos, and grammar mistakes.
- Hard to read code, which might be a result of messy code or lacking comments to make it more readable.

Strong effort exhibits work that surpasses weak effort, such as:

- Neatly presented, tidy code base and well documented code (maintainable code)
- Relatively easy to tell what was being done and how (documented code)
- Goes above and beyond what is explicitly stated

While you may discuss your work with class colleagues, submit your own work. Each task comes with specific requirements. Part of your "job" is be able to analyze what's being asked beyond the obvious.

* General Advice

Here are some general advice related to working through programming assignments.

