assignments/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-19 Sun 08:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CISC 3130 Assignments</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />
<meta name="description" content="Describe assignments for the class. Course notes at http://libguides.brooklyn.cuny.edu/cisc3130"
 />
<link href="http://fonts.googleapis.com/css?family=Quicksand:400,700|Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="spec-style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">CISC 3130 Assignments
<br />
<span class="subtitle">Department of Computer &amp; Information Science, Brooklyn College</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org22be7a1">Assignment Due Dates</a></li>
<li><a href="#org0062801">1. Objective</a>
<ul>
<li><a href="#org69506cf">1.1. Your Role</a></li>
<li><a href="#org0c3018e">1.2. Technology requirements</a></li>
<li><a href="#orgb868968">1.3. Grading Rubric</a></li>
</ul>
</li>
<li><a href="#org3e36041">2. General Advice</a>
<ul>
<li><a href="#org0e7b1c3">2.1. The Act of Problem Solving</a></li>
<li><a href="#orgd3f2228">2.2. Great code is great pose</a></li>
<li><a href="#org6dae120">2.3. Following spec</a></li>
<li><a href="#org262a888">2.4. Other Tips</a>
<ul>
<li><a href="#org5b8b5cc">2.4.1. Don't procrastinate.</a></li>
<li><a href="#org340bb36">2.4.2. Be organized.</a></li>
<li><a href="#orgf4a245d">2.4.3. Persist.</a></li>
<li><a href="#org3235405">2.4.4. Find the tools that work for you.</a></li>
<li><a href="#org9d4e837">2.4.5. Developing fluency.</a></li>
</ul>
</li>
<li><a href="#help">2.5. Asking for help</a></li>
</ul>
</li>
<li><a href="#orgd20ed90">3. Project template</a>
<ul>
<li><a href="#org1dd6407">3.1. Motivations</a></li>
<li><a href="#org964c0ac">3.2. Where to find it</a></li>
</ul>
</li>
<li><a href="#orgf1d64cd">4. The Tasks</a>
<ul>
<li><a href="#a1">[A1] Top Streaming Artists</a>
<ul>
<li><a href="#org80a500f">Problem Description</a></li>
<li><a href="#org3f57fe0">Where to Submit</a></li>
</ul>
</li>
<li><a href="#a2">[A2] Music playlist</a>
<ul>
<li><a href="#org4805461">Problem Description:</a></li>
<li><a href="#org068ff9e">Where to Submit:</a></li>
</ul>
</li>
<li><a href="#a3">[A3]  Assignment 3</a></li>
<li><a href="#a4">[A4] Assignment 4</a></li>
<li><a href="#a5">[A5] Assignment 5</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta" style="font-size:12px">
<p>
<b>Author:</b> Katherine Chuang (chuang@sci.brooklyn.cuny.edu)<br />
<i>This is part of the OER resource released under Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.</i>
</p>
</div>


<div id="outline-container-org22be7a1" class="outline-2">
<h2 id="org22be7a1">Assignment Due Dates</h2>
<div class="outline-text-2" id="text-org22be7a1">
<p>
This section to summarize the links for submitting assignments. Each of the google form creates a spreadsheet, that makes it helpful for me to review each submission.
</p>

<div style="width:550px;text-align:left;">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Assignment</b></th>
<th scope="col" class="org-left">Due Date</th>
<th scope="col" class="org-left">Link</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[A1]</code> <a href="#a1">Top Streaming Music Artists</a></td>
<td class="org-left">2/20/2020</td>
<td class="org-left">Form</td>
</tr>

<tr>
<td class="org-left"><code>[A2]</code> <a href="#a2">Music Playlist</a></td>
<td class="org-left">3/5/2020</td>
<td class="org-left">Form</td>
</tr>

<tr>
<td class="org-left"><code>[A3]</code> <a href="#a3">Assignment 3</a></td>
<td class="org-left">3/19/2020</td>
<td class="org-left">Form</td>
</tr>

<tr>
<td class="org-left"><code>[A4]</code> <a href="#a4">Assignment 4</a></td>
<td class="org-left">4/2/2020</td>
<td class="org-left">Form</td>
</tr>

<tr>
<td class="org-left"><code>[A5]</code> <a href="#a5">Assignment 5</a></td>
<td class="org-left">4/30/2020</td>
<td class="org-left">Form</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org0062801" class="outline-2">
<h2 id="org0062801"><span class="section-number-2">1</span> Objective</h2>
<div class="outline-text-2" id="text-1">
<p>
Take home assignments are opportunities to enhance the concepts and theories we cover in class in a more tangible way. You would find the most value of these assignments if you treat them with the seriousness as if you were employed but a VIP client, albeit with obscure and outdated data processing needs.
</p>

<p>
Assignments are structured as if you were hired on as a developer in training.
</p>
</div>

<div id="outline-container-org69506cf" class="outline-3">
<h3 id="org69506cf"><span class="section-number-3">1.1</span> Your Role</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Imagine you are the developer and manager hh
on a team of one. This means that you are solely responsible for delivering your code on time, and. That the code you produce you are
 proud of owning. All the tasks are specified in advance so that you can schedule time to complete them in your own time.
</p>

<p>
All the assignments boil down to an essence with very similar work flow:
</p>

<ul class="org-ul">
<li>Read in a text file provided</li>
<li>Process text file as needed by the task requirements</li>
<li>Output as specified by the assignment requirements</li>
<li>Submit the code to the form by the due date</li>
</ul>

<p>
The project tasks are scoped to be bite sized pieces of much more full-fledged programming projects for large companies, which go through the steps to extract, transform, and load (ETL) data into databases.
</p>

<p>
While full time professions might work with gigabytes or terabytes of data at a time, in this class we will limit data sizes of 1MB or smaller text files per assignment. That being said, we will not be concerned with transforming data from one product to another. We will just be using Java programs to convert data from unstructured to structured data.
</p>

<p>
Each of the assignments can be completed within an afternoon by an experienced programmer who has grasped the fundamentals of data structure concepts. Since you are learning the data structures this semester, you will likely need more than a couple of hours so the assignments are scheduled such that you have approximately two weeks of time to focus on each.
</p>
</div>
</div>

<div id="outline-container-org0c3018e" class="outline-3">
<h3 id="org0c3018e"><span class="section-number-3">1.2</span> Technology requirements</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Your text editor/IDE of choice. I mainly use vim or emacs text editor <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
<li>Your version control system (VCS) of choice. I mainly use git and github <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li>Internet connection to submit the assignment by the due date</li>
<li>Might add more later</li>
</ul>
</div>
</div>

<div id="outline-container-orgb868968" class="outline-3">
<h3 id="orgb868968"><span class="section-number-3">1.3</span> Grading Rubric</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The assignments will be graded on a scale of <i>strong effort</i> and <i>weak effort</i>. Late assignments means submitting any time after the specified due date, and will limited to score of one regardless of the level of effort. Not turning in on time will be given a score of zero. Late assignments will be accepted until the close of business on 4/30/2020 All assignments combined are 20% of your final grade.
</p>

<p>
Weak effort looks like someone who rushed to get the work done. For example,
</p>

<ul class="org-ul">
<li>Met most of specs but didn't check carefully over their work.</li>
<li>Noticeable amount of typos, and grammar mistakes.</li>
<li>Hard to read code, which might be a result of messy code or lacking comments to make it more readable.</li>
</ul>

<p>
Strong effort exhibits work that surpasses weak effort, such as:
</p>

<ul class="org-ul">
<li>Neatly presented, tidy code base and well documented code (maintainable code)</li>
<li>Relatively easy to tell what was being done and how (documented code)</li>
<li>Goes above and beyond what is explicitly stated</li>
</ul>

<p>
While you may discuss your work with class colleagues, submit your own work. Each task comes with specific requirements. Part of your "job" is be able to analyze what's being asked beyond the obvious.
</p>
</div>
</div>
</div>

<div id="outline-container-org3e36041" class="outline-2">
<h2 id="org3e36041"><span class="section-number-2">2</span> General Advice</h2>
<div class="outline-text-2" id="text-2">
<p>
Here are some general advice related to working through programming assignments.
</p>
</div>
