src/spring2020.org
** The Act of Problem Solving

Programming is not just about the syntax of programming languages. It might have been the focus of your previous CS courses, however as you progress in your tech careers it becomes a small part of a larger scope of your skills.  Computer science as a field is about solving problems, and computing the solution(s). You'll hear many versions of this thing about solving problems. Great computer scientists are great problem solvers.

Programming is about solving problems. You have to understand the problem before you can solve it adequately. You have to understand how to break down the problem into operational steps before you can tell a computer the steps.

Before you begin coding, think about the problem. Reading comprehension skills matter. Think about why you might have been suggested to use that data structure. Ability to be a thinker - to analytically and critically think about problems and solutions - is what separate the amazing and okay tech professionals and what helps determine the prevalence and longevity of your career prospects in any field.

For instance, you might want to ask yourself for each assignment, /"What are the advantages and disadvantages of using that data structure? What features come with this data structure to make it the best choice for this problem?"/ Read relevant material, discuss with class colleagues as necessary to solidify your understanding.

As you code, it helps to be conscious and actively engaged in the activity. Programming involves you to be aware of your state of mind.

** Great code is great pose

Great code is succinct, expressive, and clear the first time you read it. It tries to guide the reader through transitional steps. It aims for functions with a single main idea. Great code is clean, maintainable code.

It's uncommon to write the best looking code on the first try, especially while you're still in school learning. It can take several iterations of refactoring to get code to the most elegant form. It's encouraged that you try to develop an intuitive sense for what great code looks like so you know where to improve.

** Following spec

When you submit your assignment, check carefully the description and the items that should be submitted, and exact formatting of such. These are the /specifications/ for the assignment, and for the rest of the document referred to as "spec". Please be kind to your future self by treating these take home assignments with the same rigor as you would with future employment, in order to practice the skill of adhering to spec.

- Do your best to meet the specs.
- Ensure that the code compiles and works
- Ensure that you meet the “business logic” conditions that were specified work
- Files asked for are in the item turned in

Note that in life by nature of reality and one's discernment abilities, some specs will be obvious, some will be less obvious. Take the opportunity to practice developing the ability to deduce the not stated.

** Other Tips
*** Don't procrastinate.
Very few developers figure out the code in one sitting. Schedule your work in chunks. Some common chunks:
**** summarizing the requirements for the task and plausible test conditions to ensure the requirements are met
****  thinking about the methods and classes needed and how data flows to each other
****  writing the code
**** testing code to see if it matches test conditions
**** preparing the submission
*** Be organized.
Being organized helps a lot. Organizational skills is the bread and butter of data structures (the bread and butter of computer science).
*** Persist.
Don’t give up immediately if you can’t get figure out the error error. Systematically try and try again. Make notes for yourself on what didn’t work, your hypotheses, and also what worked. This can include retracing your code line by line, searching the internet, chatting with someone.
*** Find the tools that work for you.
Recommended workflow for assignments using linux/unix flavored tools will be explained early on in the semester just to cover briefly one way to complete the assignments. Treat that as a senior developer passing on some advice. You don't have to use the proposed set of tools.
*** Developing fluency.
Some of you may be more comfortable with what the assignments are asking. Some may be less comfortable. If you’re on the less comfortable side, please make sure to read any suggested reading material. You may ask me for help however note that when you ask for my support, I will ask you what you’ve read and tried to start off discussion.


- We are going to use the department official language, Java 8, for most of the course.
- You're welcome to explore practicing with other programming languages and submit with other languages. You will get credit for work in another language so long as your submission includes a write up explaining why you chose that language over languages. "I don't like programming in the Object Oriented Paradigm" is perfectly fine, if you can give more reasons comparing advantages and disadvantages of features that would be better. Length should be what could constitute as "a long email".


** Asking for help
:PROPERTIES:
:CUSTOM_ID: help
:END:

In previous courses, students have found it helpful to form study groups to discuss the requirements and their solutions with each other. Please feel free to organize a study group.

If anything is unclear please write an email explaining what is confusing you. Writing more detail with what you're struggling with helps, please include a minimal working example (MWE) where relevant to do so.

Office hours are available for students who need further clarification of concepts presented in lecture, or have made solid attempts on the homework assignments or other practice problems and require further assistance understanding how to approach such problems.

* Project template

When there are multiple waves of similar work to be done for multiple projects, a developer might prepare a standard example of a "core" set of files to reference or reuse. Since the project assignments all require reading in an input text file, I've prepared an example that could potentially be used.

You may create your own /template/ or use the one provided. When you create your own, strive to make files and code easy to find, and easy to read. Think about how you want to organize your files. Do you want one repository per assignment? All assignments in one repository, with different subfolders? Or would you prefer different Java files? There are pros and cons to each design choice, and picking one can sometimes be based on subjective choice.

