assignments/index.html

<div id="outline-container-org0e7b1c3" class="outline-3">
<h3 id="org0e7b1c3"><span class="section-number-3">2.1</span> The Act of Problem Solving</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Programming is not just about the syntax of programming languages. It might have been the focus of your previous CS courses, however as you progress in your tech careers it becomes a small part of a larger scope of your skills.  Computer science as a field is about solving problems, and computing the solution(s). You'll hear many versions of this thing about solving problems. Great computer scientists are great problem solvers.
</p>

<p>
Programming is about solving problems. You have to understand the problem before you can solve it adequately. You have to understand how to break down the problem into operational steps before you can tell a computer the steps.
</p>

<p>
Before you begin coding, think about the problem. Reading comprehension skills matter. Think about why you might have been suggested to use that data structure. Ability to be a thinker - to analytically and critically think about problems and solutions - is what separate the amazing and okay tech professionals and what helps determine the prevalence and longevity of your career prospects in any field.
</p>

<p>
For instance, you might want to ask yourself for each assignment, <i>"What are the advantages and disadvantages of using that data structure? What features come with this data structure to make it the best choice for this problem?"</i> Read relevant material, discuss with class colleagues as necessary to solidify your understanding.
</p>

<p>
As you code, it helps to be conscious and actively engaged in the activity. Programming involves you to be aware of your state of mind.
</p>
</div>
</div>

<div id="outline-container-orgd3f2228" class="outline-3">
<h3 id="orgd3f2228"><span class="section-number-3">2.2</span> Great code is great pose</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Great code is succinct, expressive, and clear the first time you read it. It tries to guide the reader through transitional steps. It aims for functions with a single main idea. Great code is clean, maintainable code.
</p>
</div>
</div>

<div id="outline-container-org6dae120" class="outline-3">
<h3 id="org6dae120"><span class="section-number-3">2.3</span> Following spec</h3>
<div class="outline-text-3" id="text-2-3">
<p>
When you submit your assignment, check carefully the description and the items that should be submitted, and exact formatting of such. These are the <i>specifications</i> for the assignment, and for the rest of the document referred to as "spec". Please be kind to your future self by treating these take home assignments with the same rigor as you would with future employment, in order to practice the skill of adhering to spec.
</p>

<ul class="org-ul">
<li>Do your best to meet the specs.</li>
<li>Ensure that the code compiles and works</li>
<li>Ensure that you meet the “business logic” conditions that were specified work</li>
<li>Files asked for are in the item turned in</li>
</ul>

<p>
Note that in life by nature of reality and one's discernment abilities, some specs will be obvious, some will be less obvious. Take the opportunity to practice developing the ability to deduce the not stated.
</p>
</div>
</div>

<div id="outline-container-org262a888" class="outline-3">
<h3 id="org262a888"><span class="section-number-3">2.4</span> Other Tips</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org5b8b5cc" class="outline-4">
<h4 id="org5b8b5cc"><span class="section-number-4">2.4.1</span> Don't procrastinate.</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Very few developers figure out the code in one sitting. Schedule your work in chunks. Some common chunks:
</p>
</div>
<ol class="org-ol">
<li><a id="orgdee17a2"></a>summarizing the requirements for the task and plausible test conditions to ensure the requirements are met<br /></li>
<li><a id="org17733eb"></a>thinking about the methods and classes needed and how data flows to each other<br /></li>
<li><a id="org3b66779"></a>writing the code<br /></li>
<li><a id="org352b0aa"></a>testing code to see if it matches test conditions<br /></li>
<li><a id="org4c486d6"></a>preparing the submission<br /></li>
</ol>
</div>
<div id="outline-container-org340bb36" class="outline-4">
<h4 id="org340bb36"><span class="section-number-4">2.4.2</span> Be organized.</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Being organized helps a lot. Organizational skills is the bread and butter of data structures (the bread and butter of computer science).
</p>
</div>
</div>
<div id="outline-container-orgf4a245d" class="outline-4">
<h4 id="orgf4a245d"><span class="section-number-4">2.4.3</span> Persist.</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
Don’t give up immediately if you can’t get figure out the error error. Systematically try and try again. Make notes for yourself on what didn’t work, your hypotheses, and also what worked. This can include retracing your code line by line, searching the internet, chatting with someone.
</p>
</div>
</div>
<div id="outline-container-org3235405" class="outline-4">
<h4 id="org3235405"><span class="section-number-4">2.4.4</span> Find the tools that work for you.</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
Recommended workflow for assignments using linux/unix flavored tools will be explained early on in the semester just to cover briefly one way to complete the assignments. Treat that as a senior developer passing on some advice. You don't have to use the proposed set of tools.
</p>
</div>
</div>
<div id="outline-container-org9d4e837" class="outline-4">
<h4 id="org9d4e837"><span class="section-number-4">2.4.5</span> Developing fluency.</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
Some of you may be more comfortable with what the assignments are asking. Some may be less comfortable. If you’re on the less comfortable side, please make sure to read any suggested reading material. You may ask me for help however note that when you ask for my support, I will ask you what you’ve read and tried to start off discussion.
</p>


<ul class="org-ul">
<li>We are going to use the department official language, Java 8, for most of the course.</li>
<li>You're welcome to explore practicing with other programming languages and submit with other languages. You will get credit for work in another language so long as your submission includes a write up explaining why you chose that language over languages. "I don't like programming in the Object Oriented Paradigm" is perfectly fine, if you can give more reasons comparing advantages and disadvantages of features that would be better. Length should be what could constitute as "a long email".</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgae8b523" class="outline-3">
<h3 id="help"><a id="orgae8b523"></a><span class="section-number-3">2.5</span> Asking for help</h3>
<div class="outline-text-3" id="text-help">
<p>
In previous courses, students have found it helpful to form study groups to discuss the requirements and their solutions with each other. Please feel free to organize a study group.
</p>

<p>
If anything is unclear please write an email explaining what is confusing you. Writing more detail with what you're struggling with helps, please include a minimal working example (MWE) where relevant to do so.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd20ed90" class="outline-2">
<h2 id="orgd20ed90"><span class="section-number-2">3</span> Project template</h2>
<div class="outline-text-2" id="text-3">
<p>
When there are multiple waves of similar work to be done for multiple projects, a developer might prepare a standard example of a "core" set of files to reference or reuse. Since the project assignments all require reading in an input text file, I've prepared an example that could potentially be used.
</p>

<p>
You may create your own <i>template</i> or use the one provided. When you create your own, strive to make files and code easy to find, and easy to read. Think about how you want to organize your files. Do you want one repository per assignment? All assignments in one repository, with different subfolders? Or would you prefer different Java files? There are pros and cons to each design choice, and picking one can sometimes be based on subjective choice.
</p>
</div>
