src/spring2020.org
** Motivations

The prepared code repository aims to show a reasonably good sample, with meeting the following conditions.

- Demonstrates an example of generally good file organization practices, and
- Demonstrates an example of organized easy to read code, and
- Provides sample code to show students how to read from text files, and
- Serves as a baseline for showing students language fluency level needed as prerequisite for the course.

** Where to find it

The link to this template repository is: https://github.com/cisc3130-s20/assignment-template

There is a GitHub organization for this semester named *~CISC3130-s20~*.

* The Tasks

Descriptions for each assignment is given below.
#+TOC: headlines 1 local

** [A1] Top Streaming Artists
:PROPERTIES:
:UNNUMBERED: notoc
:CUSTOM_ID: a1
:FORM_URL: https://docs.google.com/forms/d/e/1FAIpQLScoTdzWI9jpKVkvAejzHfDfUoDf1rFd931S-ei2puA6zZbBzg/viewform
:END:

*** Learning Objectives

- Review prerequisite Java programming knowledge by putting together a small project
- Review the of the Java [[https://docs.oracle.com/javase/tutorial/java/nutsandbolts/arrays.html][array]] type, scaling to 2D arrays
- Review of Java OOP concepts with creating classes, and instantiating them
- Create custom linked list class with appropriate members and methods
- Compare the operations for working with the array type and linked list

*** Problem Description
A record label executive received text files that contain the top streamed music artists during certain weeks. Each file represents one track by an artist. An artist's name might appear multiple times. The data comes from [[https://spotifycharts.com/][Spotify Charts]].

In order for their in house IT to be able to process the information, they need someone to help process it.

Each text file is a comma separated value (CSV) file that has a few columns like the following table [fn:3]:

| Position | Track Name                                    | Artist                    | Streams | URL |
|----------+-----------------------------------------------+---------------------------+---------+-----|
|        1 | One Dance                                     | Drake, WizKid, Kyla       |     100 | ... |
|        2 | Lean On                                       | Major Lazer, MØ, DJ Snake |      99 | ... |
|        3 | Sunflower - Spider-Man: Into the Spider-Verse | Post Malone, Swae Lee     |      98 | ... |
|        4 | Somebody That I Used to Know                  | Gotye, Kimbra             |      97 | ... |
|        5 | Rolling in the Deep                           | Adele                     |      96 | ... |
|      ... | ...                                           | ...                       |     ... | ... |
|          |                                               |                           |         |     |

 Because it's a CSV file, column delimiters are written with a ~,~ symbol. Each line in the text file represents one song.

 #+BEGIN_SRC CSV
 Position,"Track Name",Artist,Streams,URL
 #+END_SRC

****  *Who appears on the top streamed list?*

 First, the exec wants to know which artists appears on the list and how many times they appear. Prepare an output file with contents of your nested array so that the record label executive can see this report.

****** Link to Data Extract 1
****** Link to Data Extract 2

Not knowing data structures yet, it seems the way to proceed quickly at building is with Java arrays. Read in the text file and then save the ~CSV~ file format into a nested Java array like ~myList~ below. If an artist appears multiple times, then that artist probably should only appear once in your nested array.

 #+NAME: NestedArray
 #+BEGIN_SRC java
 /* Java nested array syntax */

 int cols = 4;  // arbitrary number represents columns to create
 int rows = 10; // arbitrary number represents rows to create;
 String[][] myList = new String[rows][cols];

 int[][] arr = { { 1, 2 }, { 3, 4 } };
 System.out.println("arr[0][0] = " + arr[0][0]);
 #+END_SRC

Will you limit to just the artist name? Perhaps you should discuss your decision with your class colleagues.


