assignments/index.html

<div id="outline-container-org1dd6407" class="outline-3">
<h3 id="org1dd6407"><span class="section-number-3">3.1</span> Motivations</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The prepared code repository aims to show a reasonably good sample, with meeting the following conditions.
</p>

<ul class="org-ul">
<li>Demonstrates an example of generally good file organization practices, and</li>
<li>Demonstrates an example of organized easy to read code, and</li>
<li>Provides sample code to show students how to read from text files, and</li>
<li>Serves as a baseline for showing students language fluency level needed as prerequisite for the course.</li>
</ul>
</div>
</div>

<div id="outline-container-org964c0ac" class="outline-3">
<h3 id="org964c0ac"><span class="section-number-3">3.2</span> Where to find it</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The link to the repository is: <a href="https://github.com/cisc3130-s20/assignment-template">https://github.com/cisc3130-s20/assignment-template</a>
</p>

<p>
There is a GitHub organization for this semester named <b><code>CISC3130-s20</code></b>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf1d64cd" class="outline-2">
<h2 id="orgf1d64cd"><span class="section-number-2">4</span> The Tasks</h2>
<div class="outline-text-2" id="text-4">
<p>
Descriptions for each assignment is given below.
</p>
<div id="text-table-of-contents">
<ul>
<li><a href="#a1">[A1] Top Streaming Artists</a></li>
<li><a href="#a2">[A2] Music playlist</a></li>
<li><a href="#a3">[A3]  Assignment 3</a></li>
<li><a href="#a4">[A4] Assignment 4</a></li>
<li><a href="#a5">[A5] Assignment 5</a></li>
</ul>
</div>
</div>

<div id="outline-container-org64dbcac" class="outline-3">
<h3 id="a1"><a id="org64dbcac"></a>[A1] Top Streaming Artists</h3>
<div class="outline-text-3" id="text-a1">
</div>

<div id="outline-container-org80a500f" class="outline-4">
<h4 id="org80a500f">Problem Description</h4>
<div class="outline-text-4" id="text-org80a500f">
<p>
A record label executive received text files that contain the top streamed music artists during certain weeks. Each file represents one track by an artist. An artist's name might appear multiple times. The data comes from <a href="https://spotifycharts.com/">Spotify Charts</a>.
</p>

<p>
In order for their in house IT to be able to process the information, they need someone to help process it.
</p>

<p>
Each text file is a comma separated value (CSV) file that has a few columns like the following table <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Position</th>
<th scope="col" class="org-left">Track Name</th>
<th scope="col" class="org-left">Artist</th>
<th scope="col" class="org-right">Streams</th>
<th scope="col" class="org-left">URL</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">One Dance</td>
<td class="org-left">Drake, WizKid, Kyla</td>
<td class="org-right">100</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Lean On</td>
<td class="org-left">Major Lazer, MØ, DJ Snake</td>
<td class="org-right">99</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Sunflower - Spider-Man: Into the Spider-Verse</td>
<td class="org-left">Post Malone, Swae Lee</td>
<td class="org-right">98</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Somebody That I Used to Know</td>
<td class="org-left">Gotye, Kimbra</td>
<td class="org-right">97</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Rolling in the Deep</td>
<td class="org-left">Adele</td>
<td class="org-right">96</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Because it's a CSV file, column delimiters are written with a <code>,</code> symbol. Each line in the text file represents one song.
</p>

<div class="org-src-container">
<pre class="src src-CSV">Position,"Track Name",Artist,Streams,URL
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="org8fb87ef"></a><b>Who appears on the top streamed list?</b><br />
<div class="outline-text-5" id="text-org8fb87ef">
<p>
First, the exec wants to know which artists appears on the list and how many times they appear. Prepare an output file with contents of your nested array so that the record label executive can see this report.
</p>
</div>

<ul class="org-ul">
<li><a id="org87ea92d"></a>Link to Data Extract 1<br /></li>
<li><a id="org94147c7"></a>Link to Data Extract 2<br />
<div class="outline-text-7" id="text-org94147c7">
<p>
Not knowing data structures yet, it seems the way to proceed quickly at building is with Java arrays. Read in the text file and then save the <code>CSV</code> file format into a nested Java array like <code>myList</code> below. If an artist appears multiple times, then that artist probably should only appear once in your nested array.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org4570db8"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Java nested array syntax */</span>

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">cols</span> = <span style="color: #4e3163;">4</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arbitrary number represents columns to create</span>
<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">rows</span> = <span style="color: #4e3163;">10</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">arbitrary number represents rows to create;</span>
<span style="color: #ba2f59; font-weight: bold;">String</span><span style="color: #3a81c3;">[][]</span> <span style="color: #715ab1;">myList</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">String</span><span style="color: #3a81c3;">[</span>rows<span style="color: #3a81c3;">][</span>cols<span style="color: #3a81c3;">]</span>;

<span style="color: #ba2f59; font-weight: bold;">int</span><span style="color: #3a81c3;">[][]</span> <span style="color: #715ab1;">arr</span> = <span style="color: #3a81c3;">{</span> <span style="color: #6c3163;">{</span> <span style="color: #4e3163;">1</span>, <span style="color: #4e3163;">2</span> <span style="color: #6c3163;">}</span>, <span style="color: #6c3163;">{</span> <span style="color: #4e3163;">3</span>, <span style="color: #4e3163;">4</span> <span style="color: #6c3163;">}</span> <span style="color: #3a81c3;">}</span>;
System.out.println<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"arr[0][0] = "</span> + arr<span style="color: #6c3163;">[</span><span style="color: #4e3163;">0</span><span style="color: #6c3163;">][</span><span style="color: #4e3163;">0</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>;
</pre>
</div>

<p>
Will you limit to just the artist name? Perhaps you should discuss your decision with your class colleagues.
</p>
</div>
</li>
</ul>
</li>
