src/spring2020.org
**** *Who are the music artists (in alphabetical order)?*

It just so happens that this imaginary VIP client has a thing for alphabetized lists and wants to see the artist names in alphabetical order. Since you learned about linked lists in class, you should know how to create one.

You can probably take the array from part 1, which is hopefully a truncated version of the raw data, and insert artist names into a sorted linked list.

You may use the example classes below to start with to design a sorted list of ~TopStreamingArtists~. You may also create your own classes. The classes work like templates because they offer a blueprint, where you can reuse the object oriented structure by creating objects from those classes.

 #+NAME: TopHits
 #+BEGIN_SRC java
/* A node represents an artist */
 class Artist {
    private String name;
    private Artist next;
   // add constructors
 }

/* The List TopStreamingArtists is composed of a series of artist names */
 class TopStreamingArtists {
    private Artist first;
    public void TopStreamingArtists(){
      first = null;
    }
    public boolean isEmpty(){
     return (first == null);
    }
 }
 #+END_SRC

Using the linked list structure you've designed and created, you can resume with the data processing in order to provide another report to the  insert an artist name to the ~TopStreamingArtists~ linked list.

 #+NAME: TopHitsObject
 #+BEGIN_SRC java
 public static void main(String [ ] args) {
     TopStreamingArtists artistNames = new TopStreamingArtists();
     artistNames.insert("Stage Name");
     artistNames.displayList();
 }
 #+END_SRC

Make sure to print out the report for the exec showing the data in ascending order by Artist name.



*** Where to Submit

Please fill out this _form_ (link not yet available)

What you should submit is a link to where your code repository is located. Your code repository should have the elements described in the project template section. It should also match the items asked for in parts 1 and 2 above.

Specifically:

****** TODO How did you organize your files?
****** TODO Who appears on the top streamed list?
****** TODO Who are the music artists (in alphabetical order)?


** [A2] Music playlist
:PROPERTIES:
:UNNUMBERED: notoc
:CUSTOM_ID: a2
:FORM_URL: https://docs.google.com/forms/d/e/1FAIpQLScU0yfFiwgAtiFT-XxJt4U-lbaDRA9sW_PT78tvfopk-VFjIw/viewform
:END:


*** Learning Objectives

- Practice working with multiple input files
- Review the creation of linked list class
- Create custom Stack and Queue ADTs to use
- Perform operations with the custom defined ADTs to see the advantages and disadvantages of each

*** Problem Description

Your VIP client wants to listen to the music tracks in this week's latest song list to review them and get a sense for what they sound like. This time your client wants you to process all the full weeks of this quarter that have already passed so you're given multiple CSV files of the same format.

Your client also says they want to listen to songs based on song/track titles in ascending order. It /must/ be in this order.

**** *Can you read from multiple input files?*

Instead of reading just one file at a time, process multiple files. It might help to store the file names in a data structure where ~myFiles = [week1, week2, week3, weekn]~ to make it easier to manage, or perhaps you want to make it possible to read any number of files in a directory.

Below is an example of how could try to start the organization of code.

#+BEGIN_SRC java
/* Storing one week of data in a queue */
public MyQueue extends LinkedList {
  // constructor creates a linked list that stores songs from one text file
  public MyQueue(String filename){
    // take the filename, open it and convert to queue
  }
}

/* An example for working with multiple text files */
public class MyApp {
  // The files you'll be reading stored in a data structure to make it iterable
  myFiles = [week1, week2, week3, weekn];

  ArrayList<WeekQueue> allTheWeeks = new ArrayList<>();

  for (int i=0; i < myFiles.length-1; i++){
    MyQueue dataExtract = new MyQueue(myFiles[i]);
    allTheWeeks.add(dataExtract);
  }
}
#+END_SRC



