assignments/index.html


<li><a id="org8e935d5"></a><b>Who are the music artists (in alphabetical order)?</b><br />
<div class="outline-text-5" id="text-org8e935d5">
<p>
It just so happens that this imaginary VIP client has a thing for alphabetized lists and wants to see the artist names in alphabetical order. Since you learned about linked lists in class, you should know how to create one.
</p>

<p>
You can probably take the array from part 1, which is hopefully a truncated version of the raw data, and insert artist names into a sorted linked list.
</p>

<p>
You may use the example classes below to start with to design a sorted list of <code>TopStreamingArtists</code>. You may also create your own classes. The classes work like templates because they offer a blueprint, where you can reuse the object oriented structure by creating objects from those classes.
</p>

<div class="org-src-container">
<pre class="src src-java" id="orge749162"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">A node represents an artist */</span>
 <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Artist</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">name</span>;
    <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Artist</span> <span style="color: #715ab1;">next</span>;
   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">add constructors</span>
 <span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The List TopStreamingArtists is composed of a series of artist names */</span>
 <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">TopStreamingArtists</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Artist</span> <span style="color: #715ab1;">first</span>;
    <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">TopStreamingArtists</span><span style="color: #6c3163;">(){</span>
      first = <span style="color: #4e3163;">null</span>;
    <span style="color: #6c3163;">}</span>
    <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">boolean</span> <span style="color: #6c3163; font-weight: bold;">isEmpty</span><span style="color: #6c3163;">(){</span>
     <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">(</span>first == <span style="color: #4e3163;">null</span><span style="color: #2d9574;">)</span>;
    <span style="color: #6c3163;">}</span>
 <span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Using the linked list structure you've designed and created, you can resume with the data processing in order to provide another report to the  insert an artist name to the <code>TopStreamingArtists</code> linked list.
</p>

<div class="org-src-container">
<pre class="src src-java" id="org231c7ab"><span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">main</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #6c3163;">[</span> <span style="color: #6c3163;">]</span> <span style="color: #715ab1;">args</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #ba2f59; font-weight: bold;">TopStreamingArtists</span> <span style="color: #715ab1;">artistNames</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">TopStreamingArtists</span><span style="color: #6c3163;">()</span>;
    artistNames.insert<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Stage Name"</span><span style="color: #6c3163;">)</span>;
    artistNames.displayList<span style="color: #6c3163;">()</span>;
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Make sure to print out the report for the exec showing the data in ascending order by Artist name.
</p>
</div>
</li>
</ul>
</div>



<div id="outline-container-org3f57fe0" class="outline-4">
<h4 id="org3f57fe0">Where to Submit</h4>
<div class="outline-text-4" id="text-org3f57fe0">
<p>
Please fill out this <span class="underline">form</span> (link not yet available)
</p>

<p>
What you should submit is a link to where your code repository is located. Your code repository should have the elements described in the project template section. It should also match the items asked for in parts 1 and 2 above.
</p>

<p>
Specifically:
</p>
</div>

<ul class="org-ul">
<li><a id="orgb176228"></a><span class="todo TODO">TODO</span> How did you organize your files?<br /></li>
<li><a id="org219b6cf"></a><span class="todo TODO">TODO</span> Who appears on the top streamed list?<br /></li>
<li><a id="orgeba0475"></a><span class="todo TODO">TODO</span> Who are the music artists (in alphabetical order)?<br /></li>
</ul>
</div>
</div>


<div id="outline-container-org1c5b669" class="outline-3">
<h3 id="a2"><a id="org1c5b669"></a>[A2] Music playlist</h3>
<div class="outline-text-3" id="text-a2">
</div>

<div id="outline-container-org4805461" class="outline-4">
<h4 id="org4805461">Problem Description:</h4>
<div class="outline-text-4" id="text-org4805461">
<p>
Your VIP client wants to listen to the music tracks in this week's latest song list to review them and get a sense for what they sound like. This time your client wants you to process all the full weeks of this quarter that have already passed so you're given multiple CSV files of the same format.
</p>

<p>
Your client also says they want to listen to songs based on song/track titles in ascending order. It <i>must</i> be in this order.
</p>
</div>

<ul class="org-ul">
<li><a id="org39a2b36"></a><b>Can you read from multiple input files?</b><br />
<div class="outline-text-5" id="text-org39a2b36">
<p>
Instead of reading just one file at a time, process multiple files. It might help to store the file names in a data structure where <code>myFiles = [week1, week2, week3, weekn]</code> to make it easier to manage, or perhaps you want to make it possible to read any number of files in a directory.
</p>

<p>
Below is an example of how could try to start the organization of code.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Storing one week of data in a queue */</span>
<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">MyQueue</span> <span style="color: #3a81c3; font-weight: bold;">extends</span> <span style="color: #ba2f59; font-weight: bold;">LinkedList</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">constructor creates a linked list that stores songs from one text file</span>
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #6c3163; font-weight: bold;">MyQueue</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">filename</span><span style="color: #6c3163;">){</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">take the filename, open it and convert to queue</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">An example for working with multiple text files */</span>
<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">MyApp</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The files you'll be reading stored in a data structure to make it iterable</span>
  myFiles = <span style="color: #6c3163;">[</span>week1, week2, week3, weekn<span style="color: #6c3163;">]</span>;

  <span style="color: #ba2f59; font-weight: bold;">ArrayList</span><span style="color: #6c3163;">&lt;</span><span style="color: #ba2f59; font-weight: bold;">WeekQueue</span><span style="color: #6c3163;">&gt;</span> <span style="color: #715ab1;">allTheWeeks</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">ArrayList</span><span style="color: #6c3163;">&lt;&gt;()</span>;

  <span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #715ab1;">i</span>=<span style="color: #4e3163;">0</span>; i &lt; myFiles.<span style="color: #ba2f59; font-weight: bold;">length</span>-<span style="color: #4e3163;">1</span>; i++<span style="color: #6c3163;">){</span>
    <span style="color: #ba2f59; font-weight: bold;">MyQueue</span> <span style="color: #715ab1;">dataExtract</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">MyQueue</span><span style="color: #2d9574;">(</span>myFiles<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>;
    allTheWeeks.add<span style="color: #2d9574;">(</span>dataExtract<span style="color: #2d9574;">)</span>;
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</li>
