src/spring2020.org
**** *Can you build a playlist?*

In class not too long ago we went over the design of various types of linked list design patterns available. Some of these linked lists are conducive to inserting items to one end and removing from the other end.

#+BEGIN_SRC java
/* The Playlist implementation */

class Song {
  private String track;
  private Song next;
  // add constructors
}
public class Playlist {
  private Song first;
  public void Playlist(){
    // constructor for creating a new list
  }
  public void addSong(Song s){

  }
  public Song listenToSong(){
    // retrieves the next song to listen to
  }
}
#+END_SRC

Once you read in multiple files, you'll likely have sorted lists. Try to merge these multiple arrays together into one single sorted queue. Below is an example of merging 2 sorted lists into one.

#+BEGIN_SRC java
/* This function takes two queues and returns one into one */
public MyQueue mergingFunction(MyQueue q1, MyQueue q2){

}
#+END_SRC


****  *Can you track what was recently listened to?*

As a song is removed from the song playlist, it should go to the data structure tracking the listing history. In class we learned about the stack data structure that can let you easily access the most recently inserted item.

#+BEGIN_SRC java
/* The SongHistoryList implementation */

public class SongHistoryList {
  private Song first;
  public void SongHistoryList(){
    // constructor for creating a new list
  }
  public void addSong(Song s){

  }
  public Song lastListened(){
    // retrieves the next song to listen to
  }
}
#+END_SRC



*** Where to Submit

Please fill out this _form_ (link not yet available)

What you should submit is a link to where your code repository is located. Your code repository should have the elements described in the project template section. It should also match the items asked for in parts 1 and 2 above.

****** TODO How did you organize your files?
****** TODO How did you build your playlist?
****** TODO How did you track the recently listened to tracks
** [A3]  Assignment 3
:PROPERTIES:
:UNNUMBERED: notoc
:CUSTOM_ID: a3
:FORM_URL: https://docs.google.com/forms/d/e/1FAIpQLSeyj09ooNGF5AUag9oYMBr170XqlCuvAldypqU_EkI1ceVdUQ/viewform
:END:
Section left blank for now

*** Learning Objectives

-
-

*** Problem Description



** [A4] Assignment 4
:PROPERTIES:
:UNNUMBERED: notoc
:CUSTOM_ID: a4
:FORM_URL: https://docs.google.com/forms/d/e/1FAIpQLSecWRBZvBIQVuHnCphMN4hA5NDTyYz54QxXcv9HFWG1d44Yrw/viewform
:END:
Section left blank for now

** [A5] Assignment 5
:PROPERTIES:
:UNNUMBERED: notoc
:CUSTOM_ID: a5
:FORM_URL: https://docs.google.com/forms/d/e/1FAIpQLSeQjRDbv5OSdQ5r9lhcbLnOX_MXHkqW014wy3K2ibKF0INjOg/viewform
:END:
Section left blank for now

* Footnotes

[fn:1] I am unfamiliar with most of the IDEs in vogue today and therefore unlikely to be a good resource for helping you through IDE issues. Please find a class colleague to help you.
[fn:2] Git is an open source version control system. Some information summarized on the [[https://libguides.brooklyn.cuny.edu/c.php?g=986722&p=7152056][OER course page]]
[fn:3] This list comes from [[https://newsroom.spotify.com/2019-12-03/the-top-songs-artists-playlists-and-%20podcasts-of-2019-and-the-last-decade/][The Top Songs, Artists, Playlists, and Podcasts of 2019—and the Last Decade]] (accessed 2020-01-16)
