assignments/index.html



<li><a id="org56c0572"></a><b>Can you build a playlist?</b><br />
<div class="outline-text-5" id="text-org56c0572">
<p>
In class not too long ago we went over the design of various types of linked list design patterns available. Some of these linked lists are conducive to inserting items to one end and removing from the other end.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The Playlist implementation */</span>

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">track</span>;
  <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #715ab1;">next</span>;
  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">add constructors</span>
<span style="color: #3a81c3;">}</span>
<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">Playlist</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #715ab1;">first</span>;
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">Playlist</span><span style="color: #6c3163;">(){</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">constructor for creating a new list</span>
  <span style="color: #6c3163;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">addSong</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #715ab1;">s</span><span style="color: #6c3163;">){</span>

  <span style="color: #6c3163;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #6c3163; font-weight: bold;">listenToSong</span><span style="color: #6c3163;">(){</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">retrieves the next song to listen to</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Once you read in multiple files, you'll likely have sorted lists. Try to merge these multiple arrays together into one single sorted queue. Below is an example of merging 2 sorted lists into one.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">This function takes two queues and returns one into one */</span>
<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">MyQueue</span> <span style="color: #6c3163; font-weight: bold;">mergingFunction</span><span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">MyQueue</span> <span style="color: #715ab1;">q1</span>, <span style="color: #ba2f59; font-weight: bold;">MyQueue</span> <span style="color: #715ab1;">q2</span><span style="color: #3a81c3;">){</span>

<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="orge35bc7a"></a><b>Can you track what was recently listened to?</b><br />
<div class="outline-text-5" id="text-orge35bc7a">
<p>
As a song is removed from the song playlist, it should go to the data structure tracking the listing history. In class we learned about the stack data structure that can let you easily access the most recently inserted item.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">The SongHistoryList implementation */</span>

<span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">SongHistoryList</span> <span style="color: #3a81c3;">{</span>
  <span style="color: #3a81c3; font-weight: bold;">private</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #715ab1;">first</span>;
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">SongHistoryList</span><span style="color: #6c3163;">(){</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">constructor for creating a new list</span>
  <span style="color: #6c3163;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">addSong</span><span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #715ab1;">s</span><span style="color: #6c3163;">){</span>

  <span style="color: #6c3163;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">public</span> <span style="color: #ba2f59; font-weight: bold;">Song</span> <span style="color: #6c3163; font-weight: bold;">lastListened</span><span style="color: #6c3163;">(){</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">retrieves the next song to listen to</span>
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>



<div id="outline-container-org068ff9e" class="outline-4">
<h4 id="org068ff9e">Where to Submit:</h4>
<div class="outline-text-4" id="text-org068ff9e">
<p>
Please fill out this <span class="underline">form</span> (link not yet available)
</p>

<p>
What you should submit is a link to where your code repository is located. Your code repository should have the elements described in the project template section. It should also match the items asked for in parts 1 and 2 above.
</p>
</div>

<ul class="org-ul">
<li><a id="org79cd906"></a><span class="todo TODO">TODO</span> How did you organize your files?<br /></li>
<li><a id="org165633e"></a><span class="todo TODO">TODO</span> How did you build your playlist?<br /></li>
<li><a id="orge21e87b"></a><span class="todo TODO">TODO</span> How did you track the recently listened to tracks<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga9a2db1" class="outline-3">
<h3 id="a3"><a id="orga9a2db1"></a>[A3]  Assignment 3</h3>
<div class="outline-text-3" id="text-a3">
<p>
Section left blank for now
</p>
</div>
</div>

<div id="outline-container-org3e08ed3" class="outline-3">
<h3 id="a4"><a id="org3e08ed3"></a>[A4] Assignment 4</h3>
<div class="outline-text-3" id="text-a4">
<p>
Section left blank for now
</p>
</div>
</div>

<div id="outline-container-org6456d04" class="outline-3">
<h3 id="a5"><a id="org6456d04"></a>[A5] Assignment 5</h3>
<div class="outline-text-3" id="text-a5">
<p>
Section left blank for now
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
I am unfamiliar with most of the IDEs in vogue today and therefore unlikely to be a good resource for helping you through IDE issues. Please find a class colleague to help you.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Git is an open source version control system. Some information summarized on the <a href="https://libguides.brooklyn.cuny.edu/c.php?g=986722&amp;p=7152056">OER course page</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
This list comes from <a href="https://newsroom.spotify.com/2019-12-03/the-top-songs-artists-playlists-and-%20podcasts-of-2019-and-the-last-decade/">The Top Songs, Artists, Playlists, and Podcasts of 2019—and the Last Decade</a> (accessed 2020-01-16)
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-27</p>
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-01-19 Sun 08:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
